{
    "Guide to Arts Majors 2022 page 1": [
        "  Copyright: Higher Education Office, Raffles Institution, 2022  All information accurate as of Feb 2022.          AN INTRODUCTION TO  THE ARTS & SOCIAL  SCIENCES MAJORS                          C O M P I L E D  B Y  T H E  H I G H E R  E D U C A T I O N  O F F I C E ,    R A F F L E S  I N S T I T U T I O N  2 0 2 2     "
    ],
    "Guide to Arts Majors 2022 page 2": [
        "  Copyright: Higher Education Office, Raffles Institution, 2022    2    CONTENTS    This guide introduces students to 11 popular arts and social sciences majors, and the career possibilities these majors  can lead to. It is by no means exhaustive and is meant to give a snapshot as to possibilities.   Students can note that there are complementary guides to STEM majors and Business-related majors, available in IVY  HEO as well.",
        "The discipline of Econometrics, often studied in concert with Economics, can be found in the Business- related majors guide. Take time to explore all three guides! Meanwhile,    If you are interested in………………………………………………………………………………………………………..…Jump ahead to Page  1.",
        "Philosophy…………………………………………………………………………………………………………………………………………………3  2. Psychology…………………………………………………………………………………………………………………………………………………5  3. Sociology…………………………………………………………………………………………………………………………………………………..7  4.",
        "Liberal Arts………………………………………………………………………………………………………………………………………………..9  5. Geography……………………………………………………………………………………………………………………………………………….11  6. Economics………………………………………………………………………………………………………………………………………………..13  7.",
        "Law………………………………………………………………………………………………………………………………………………………….15  8. History……………………………………………………………………………………………………………………………………………………..17  9. Political Science……………………………………………………………………………………………………………………………………….19  10.",
        "Social Work………………………………………………………………………………………………………………………………………………21  11. Linguistics…………………………………………………………………………………………………………………………………………………23      "
    ],
    "Guide to Arts Majors 2022 page 3": [
        "  Copyright: Higher Education Office, Raffles Institution, 2022    3    PHILOSOPHY  Philosophy is the study of general and fundamental questions,  such as those concerning knowledge, reason, existence, truth,  values, mind, and language.   The word “philosophy” comes from two Greek root words, philos  (meaning ‘love’) and sophia (meaning ‘wisdom’), thus,  philosophy means love of wisdom.     WHO WOULD ENJOY PHILOSOPHY?",
        " Students who enjoy questioning the fundamental nature of things might find Philosophy fascinating as it challenges our  understanding and assumptions of commonly accepted concepts and ideas. Common questions in Philosophy include,  how do we know that the world is real? Where does our idea of infinity come from?",
        "What is time? Are there absolute  moral standards or is everything relative? Is beauty only in the eyes of the beholder?",
        "Are we born with a natural number  sense? What is the connection between the brain and the mind? Do these questions intrigue you?",
        "Are you fascinated by  movies such as The Matrix, Inception, Being John Malkovich, Eternal Sunshine of the Spotless Mind, The Truman Show, or  Waking Life? If you are naturally curious about the essence of all sorts of things and find yourself reading up about these  in your free time, then Philosophy might just be for you.     WHAT DOES STUDYING PHILOSOPHY LOOK LIKE?",
        " Philosophers often love to talk about anything and everything, so you can expect to learn a bit of and read a lot about  everything. Be prepared to question and interact with tutors and peers on a wide range of topics. Philosophy is often  heavily essay-based, and may include independent research and dissertations towards the end of your degree.",
        "  Philosophy is a flexible degree that allows you to shape your  studies to your interest. There usually are foundation  modules introducing you to fundamental ideas and  arguments, such as logic. You will usually then be able to  choose what to study from a range of topics, such as ethics,  law, politics, science, social science, history, art, aesthetics,  language, religion, and so on.",
        "Sometimes, universities also  offer modules based on region, time, or culture, for example,  Ancient Chinese Philosophy.   WHERE CAN I STUDY PHILOSOPHY?  Many universities in the world offer Philosophy degrees at the undergraduate level.",
        "Philosophy can be taken as a single  degree or be combined with another subject, depending on the university offering this major. For example, in the UK, the  University of Cambridge only offers Philosophy as a single degree, but Durham University offers many interdisciplinary  Philosophy-related undergraduate degrees, such as Philosophy, Politics and Economics. Most universities in the USA offer  it in combination with other subjects, e.g. History, Philosophy and Theology.",
        "In Singapore, Philosophy can be pursued as  a single major in NTU, where students pursue a broad spectrum of modules ranging from World Religions, to Business  Ethics, to the philosophical study of the nature of love and friendship.  "
    ],
    "Guide to Arts Majors 2022 page 4": [
        "  Copyright: Higher Education Office, Raffles Institution, 2022    4    WHAT POSSIBLE PATHWAYS CAN A DEGREE IN THIS MAJOR LEAD TO?  Much of what is learned in Philosophy can be applied anywhere, as the skills acquired are transferable across many  disciplines. Studying Philosophy enhances one’s general problem solving and critical thinking skills (especially in analysing  concepts, definitions, arguments and problems), communication skills and persuasive powers (especially in presenting  ideas through well-constructed arguments and in appreciating competing positions), and writing skills.",
        "A Philosophy  major would thus qualify for any job that places a strong emphasis on these skills.   Reading Philosophy also enhances one’s ability to understand other disciplines, since many important questions about a  discipline are philosophical in nature (such as its nature, concepts, and knowledge construction). It also contributes to  the development of sound methods of research and analysis, since the philosopher has to appropriately frame  hypotheses, put problems in manageable form, conduct research, analyse evaluate data to confirm or deny hypotheses,  all the while thinking critically about the criteria necessary for judging the success and failure of research methods.",
        "For  example, philosophers often help the medical field when considering the ethical concerns involving patients and/or  treatment options. In the burgeoning field of Artificial Intelligence (AI), more firms are hiring philosophers into ‘Chief  Ethics Officer’ roles to look into AI-related output through a human lens.   In recent times, philosophy graduates have also proven to be a ticket into the tech industry – the co-founder and CEO of  Slack, Stewart Butterfield, holds undergraduate and master’s degrees in Philosophy.",
        "Tech firms today welcome  Philosophy graduates who are able to think and express themselves clearly, and are focused enough to pursue a single  line of argument – highly relevant skills that bridge hard-core engineers with sales-focused customers.   Notable individuals who studied Philosophy at university include former Pope John Paul II, former US President Bill Clinton,  co-founder of PayPal Peter Thiel, co-founder of Wikipedia Larry Sanger, business magnate and philanthropist George  Soros, Nobel prize-winning novelist Pearl S Buck, Supreme Court of Canada chief justice Beverley Mclachlin, actors Susan  Sarandon, Harrison Ford, and Richard Gere, and Burmese politician Aung San Suu Kyi. Closer to home, Thai Express  founder and restauranteur, Ivan Lee, studied Philosophy at the National University of Singapore before venturing into  business.",
        "           Adapted from:  •  American Philosophical Association. Philosophy: A Brief Guide for Undergraduates.  https://www.apaonline.org/page/undergraduates   •  American Philosophical Association.",
        "Beyond Academia: Professional Opportunities for Philosophers.  https://www.apaonline.org/page/beyondacademia   •  George Anders, “That ‘Useless’ Liberal Arts Degree Has Become Tech’s Hottest Ticket”, Forbes, 29 Jul 2015  https://www.forbes.com/sites/georgeanders/2015/07/29/liberal-arts-degree-tech/?sh=664e66f7745d   •  Jessica Shepherd. “I Think Therefore I Earn?”, The Guardian, 2007 Nov 20.",
        " https://www.theguardian.com/education/2007/nov/20/choosingadegree.highereducation   •  Rupp, Shannon. Be Employable, Study Philosophy. https://thetyee.ca/Mediacheck/2013/06/27/Study-Philosophy/   "
    ],
    "Guide to Arts Majors 2022 page 5": [
        "  Copyright: Higher Education Office, Raffles Institution, 2022    5    PSYCHOLOGY  Psychology is the scientific study of behaviour and mental  processes.  Psychologists may study a range of subjects, from the behaviour  of a single brain cell, to how individuals interact with one  another in dyadic or group settings, and variations in behaviours  across cultures. Topics include abnormal, biological, cognitive,  developmental, and social psychology.",
        "    WHO WOULD ENJOY PSYCHOLOGY?  Students who are fascinated with the workings of the human brain and how it affects behaviour, cognition, and emotions  may find Psychology interesting. Common questions examined in Psychology include, which is more important for  development - nature or nurture?",
        "What are the factors that influence relationship dynamics and interactions within group  and organizational settings? What are some intervention methods and policies that can be implemented to improve  physical and mental health across different settings (e.g., hospitals, schools, organisations) and age groups (e.g., children,  adolescents, adults)? If you are interested in several topics across different areas (e.g., Neurophysiology, Statistics,  Sociology), you may be drawn to Psychology because of its highly interdisciplinary nature.",
        "    WHAT DOES STUDYING PSYCHOLOGY LOOK LIKE?  Students can either choose to pursue a Bachelor of Arts, Bachelor  of Science or a Bachelor of Social Sciences in Psychology. A  Bachelor of Science degree is pursued if you are interested in  gaining a deeper understanding of research, the workings of the  brain and how it impacts behaviour, and/or statistical  methodology.",
        "Students who are interested in getting involved in  research can work with a faculty member as a research assistant.  In contrast, a Bachelor of Arts in Psychology may focus more on  other aspects, such as organisational behaviour, and the study of  consumerism and how people make choices. Regardless of which  option you select, all students who are interested in majoring in Psychology would need to take Introduction to  Psychology before completing any core modules.",
        "Students will also be required to take at least one course on research  methods and statistics. Each university has its own requirements and modules that students have to complete depending  on whether you are fulfilling a Bachelor of Arts, Science, or Social Sciences degree. At the end of the programme, students  may be required to complete an undergraduate capstone project or thesis that may be in the format of either a research  project or a review paper.",
        "  Students who are interested in specialising in a specific area of Psychology (e.g., Clinical, Developmental, Industrial- Organisational, Cognitive) may choose to enrol in a graduate degree programme. This ranges from pursuing a master’s  degree in Counselling Psychology to completing a doctoral degree in Industrial-Organisational Psychology.    "
    ],
    "Guide to Arts Majors 2022 page 6": [
        "  Copyright: Higher Education Office, Raffles Institution, 2022    6    WHERE CAN I STUDY PSYCHOLOGY?  Psychology is offered as an undergraduate degree both in local and overseas universities. Students can choose to pursue  Psychology as a major (either first major or second major) or a minor.",
        "Once students have completed the core courses  required for their major, they can select electives on topics that they are interested in. Due to the highly interdisciplinary  nature of Psychology, some universities may offer programmes with specific majors related to Psychology. For example,  the University of Edinburgh in the UK offers an undergraduate degree in Cognitive Science.",
        "Purdue University in the US  offers two types of majors related to Psychology: Psychological Sciences, and Brain and Behavioural Sciences. In Singapore,  Psychology can be studied as a single major in NTU, or as a major within the Faculty of Arts & Social Sciences at the College  of Humanities and Sciences (CHS) at NUS. At SMU, students who pursue a Bachelor of Social Science degree can choose  to join the Psychology, Political Science or Sociology (PPS) interdisciplinary programme, where they can choose to focus  on one of the three majors eventually (i.e., Psychology, Political Science, and Sociology).",
        " WHAT POSSIBLE PATHWAYS CAN A DEGREE IN THIS MAJOR LEAD TO?  Psychology graduates who have a firm grasp of and interest in scientific research in Psychology, such as psychometric  testing and statistical analysis, can explore jobs that are more clinical in nature, involving clinical assessments,  administering, scoring, and interpretation of standardised tests. Graduates who prefer to deal with patient diagnosis and  recovery can consider jobs in counselling, therapy, social services and education, such as sports psychologist, educational  psychologist, or substance abuse counsellor.",
        "  Graduates who prefer not to be in clinical settings can consider organisational or business settings where psychology is  applied, such as in Human Resource, Marketing and Advertising, Market Research, and Industrial and Organisational  Psychology, dealing with issues such as employee placement, productivity and motivation, as well as consumer purchase  decisions. Psychology graduates are also well placed to advise policy and strategy decisions as they leverage Psychology  theories and methods to enhance decision-making. For example, the Ministry of Defence offers roles in Defence  Psychology, engaging psychologists to guide strategic communications strategy, policy and planning, and develop  frameworks and models to help the Ministry gain in-depth understanding of defence-related issues.",
        "Similar roles are  available for psychologists in other Ministries, such as in Education, Home Affairs, and Social and Family Development.   Because reading Psychology equips the graduate with knowledge of scientific research and its associated methods, as  well as tools for interpreting data and information related to human behavioural and mental processes, there are multiple  pathways in social scientific and business fields open to Psychology majors. The eventual job fit will depend on the  graduate’s skill set, personality, and aptitude for the given role.",
        " Notable individuals who majored in Psychology include celebrity television producer Jerry Bruckheimer, actress Natalie  Portman, stand-up comedian and television host Jon Stewart, and chairman and CEO of JPMorgan Chase Jamie Dimon.  Examples of Singaporean Psychology majors who pursued non-clinical pathways include Danielle Tay, recruiting  coordinator for Facebook (Singapore), Subir Roy, Human Resource Advisor at UBS AG (Singapore), and Angela Lim, news  anchor at Channel 5.   Adapted from:  •  American Psychological Association.",
        "Psychology: APA Guidelines for the Undergraduate Psychology Major.  https://www.apa.org/ed/precollege/about/undergraduate-major  •  Kendra Cherry, “5 Types of Psychology Degrees”, Verywellmind, 20 January 2020.  https://www.verywellmind.com/psychology-degrees-2795151  •  Singapore Psychological Society.",
        "Careers in Psychology. https://singaporepsychologicalsociety.org/careers-in-psychology/   •  Vineel Maharaj, “Beyond the Psychology Major”, Psychology Today, 13 Jun 2016.   https://www.psychologytoday.com/sg/blog/beyond-the-psychology-major/201606/14-career-options-psychology-majors    "
    ],
    "Guide to Arts Majors 2022 page 7": [
        "  Copyright: Higher Education Office, Raffles Institution, 2022    7    SOCIOLOGY  Sociology is the study of societal changes and  developments as well as the social factors driving human  behaviour and relationships.   Sociologists study human behaviour at several levels: the  family unit (e.g., family love and conflict), societal level  (e.g., schools and institutions), and global level (e.g.,  population growth). Specialised topics such as race, social  class and crime are also of interest to Sociologists.",
        "   WHO WOULD ENJOY SOCIOLOGY?  Understanding the ways that society influences human behaviour and is impacted by human behaviour is key to Sociology.  Have you ever wondered how family and marriage traditions have changed with time?",
        "How has media affected the  personal choices we make? Are our opportunities governed by our racial and social class? What are some factors that  shape your identity?",
        "Are you intrigued by these questions? Do you find yourself enjoying watching crime documentaries  such as The Night Stalker, Making a Murderer, Crime Scene: The Vanishing at the Cecil Hotel on Netflix as well as  documentaries such as the 13th in your free time? Do you enjoy reading about social movements such as Black Lives  Matter or the #MeToo movement, and wonder why societies progress or regress in the ways they do?",
        "If so, then Sociology  might be a good fit for you.     WHAT DOES STUDYING SOCIOLOGY LOOK LIKE?  Sociology is a flexible degree, covering a wide range  of topics.",
        "Students can pursue either a Bachelor of  Arts or a Bachelor of Social Science Degree in  Sociology. At the start of your programme, you will be  required to complete the Introduction to Sociology  course before enrolling in any of the core or elective  courses. While each university has its own  requirements, the Sociology course work may involve  extensive essay writing and include several debates  and presentations throughout the programme.",
        "With  this discipline where answers are rarely in black-and-white, the capacity to see things from multiple perspectives and to  analyse human intent and motivation is important.    WHERE CAN I STUDY SOCIOLOGY?  Sociology is offered as an undergraduate degree both at local and overseas institutions.",
        "Students can choose to either  study Sociology as a major (as a single major or a second major) or minor since this subject can be studied alongside other,  related majors (e.g., Political Science, Religion Studies, Southeast Asian Studies etc.). For example, at the University of  Manchester, students can pursue a Bachelor of Social Science degree in Sociology. The interdisciplinary nature of  Sociology may draw students to enrol in dual major course, such as the Bachelor of Arts degree programme in Economics  and Sociology also offered by the University of Manchester.",
        "  "
    ],
    "Guide to Arts Majors 2022 page 8": [
        "  Copyright: Higher Education Office, Raffles Institution, 2022    8    Students can pursue an undergraduate degree in Sociology at NUS, NTU, and SMU. Similar to Psychology, Sociology can  be studied as a single major in NTU or is studied as a major with the Faculty of Arts and Social Sciences at NUS CHS. At  SMU, students who pursue a Bachelor of Social Science degree can choose to major in either Psychology, Political  Science or Sociology (PPS).",
        "As part of the PPS interdisciplinary major, students can choose to focus on one of the three  majors eventually.    WHAT POSSIBLE PATHWAYS CAN A DEGREE IN THIS MAJOR LEAD TO?  Sociology graduates qualify for jobs that involve means testing, market research, survey data analysis, and the like, since  they are trained social scientific research.",
        "For example, a Sociology graduate working as a market research analyst could  evaluate the effectiveness of advertising and marketing campaigns by utilizing statistical methods and other social science  research techniques to analyse and interpret data. Sociology graduates working in the civil service could utilise the same  skill set to evaluate government policies that affect the public, for instance, assessing the impact of legislation on society,  pertaining to issues like welfare, poverty, substance abuse, job training, healthcare, and to recommend ways to address  gaps. These are some of the things officers in the Ministry of Social and Family Development engage with on a regular  basis.",
        "  Sociology graduates can also consider careers in public relations, social work, counselling, community service,  rehabilitation, and correctional treatment, since they are trained to assess the needs, attitudes, and preferences of their  audience, and to apply knowledge of social dynamics and social institutions in their assessment and resolution of  problems.   Because reading Sociology equips the graduate with knowledge of scientific research and its associated methods, as well  as tools for interpreting data and information related to societal change, social dynamics, and human behaviour, there  are multiple pathways in social scientific and business fields open to Sociology majors. The eventual job fit will depend  on the graduate’s skill set, personality, and aptitude.",
        "                Adapted from:  •  American Sociological Association. What is Sociology?  https://www.asanet.org/about/what-sociology  •  British Sociological Association.",
        "Studying Sociology   https://www.britsoc.co.uk/what-is-sociology/studying-sociology/  •  Mike Profita, “Best Jobs for Graduates with a Sociology Degree”, 15 March 2021   https://www.thebalancecareers.com/top-jobs-for-sociology-majors-2059633     "
    ],
    "Guide to Arts Majors 2022 page 9": [
        "  Copyright: Higher Education Office, Raffles Institution, 2022    9    LIBERAL ARTS  A Liberal Arts education encompasses the study of several disciplines  within the liberal arts. This includes the humanities, arts, natural, and  social sciences and involves the integration of knowledge across these  areas.      WHO WOULD ENJOY LIBERAL ARTS?",
        " Do you enjoy having the option to choose from a variety of subjects across many disciplines? Does learning how  knowledge can be applied to different areas intrigue you? Do you find yourself having a hard time deciding whether to  pursue a degree in the humanities, arts, social sciences, or science?",
        "Are you unsure of what career path you would want  to take as different subjects excite you? If your response is a ‘yes’ to any of these questions, then you may want to  consider pursuing a Liberal Arts degree.    WHAT DOES STUDYING LIBERAL ARTS LOOK LIKE?",
        " In a liberal arts curriculum, students will study courses across a broad basket of  disciplines (e.g., in humanities, social sciences, and creative arts) instead of a  specific field. The value of a Liberal Arts degree is that it equips you with broad and  diverse skills (e.g., effective communication, critical thinking etc.) useful for any  occupation as well as general knowledge, rather than skills relevant for a specific  job. Students with a Liberal Arts degree will be given opportunities to hone and  develop their analytical skills across the sciences and the arts.",
        "This will be useful for  navigating questions that arise across several disciplines and integrating  information across these areas. This is highly relevant in the modern workplace,  where careers often require a range of interdisciplinary skills.  WHERE CAN I STUDY LIBERAL ARTS?",
        " Interested students can pursue a Liberal Arts education overseas, particularly in US universities, which adopts this system  of education, from larger universities like Yale and University of Michigan to smaller liberal arts colleges like Amherst  College, Wellesley College, Carleton College, Williams College and Claremont McKenna College. Outside of the US,  Bristol  University and Durham University in the UK and Waseda University in Japan also offer a Liberal Arts Education. Students  will take introductory courses across the different areas in their first two years before declaring a major.",
        "  Notably, Singapore is going towards this interdisciplinary direction, with core curricula and the capacity for unrestrictive  electives already possible in places such as NUS’ College of Humanities and Sciences (CHS). As well, SUTD’s noted  Freshmore curriculum, which ensures interdisciplinary breadth for its students, regardless of chosen majors.   Overseas, a Liberal Arts education can be pursued at a public university (e.g., a Liberal Arts Bachelor of Arts degree at  King’s College London) or a private Liberal Arts college (more common in the US).",
        "Compared to most public universities,  Liberal Arts colleges have a smaller student population. Since class sizes are smaller (on average 15 to 20 students per  class), classes are mostly discussion-based instead of the traditional instruction style (i.e., listening to the professor giving  a lecture in a large lecture hall). A smaller teacher-to-student ratio has several advantages.",
        "Students can get to know their  professors better while professors are able to invest more time and attention on the student. This may be the preferred  "
    ],
    "Guide to Arts Majors 2022 page 10": [
        "  Copyright: Higher Education Office, Raffles Institution, 2022    10    option for students who enjoy having a smaller class size and the opportunity to establish a more personable relationship  with their professor. Expect lots of engagement, debates and discussions!  WHAT POSSIBLE PATHWAYS CAN A DEGREE IN THIS MAJOR LEAD TO?",
        " Because liberal arts majors are schooled in a multi-disciplinary approach and have exposure to different fields across the  social sciences and humanities, career opportunities in any of these fields are available to them. For example, a graduate  who is passionate about history and politics can be involved in archival work, artefact curation or policy advising. A  graduate equally passionate about economics, psychology and sociology would be well placed to do market research,  business analysis, healthcare management, and human resources.",
        "Graduates can be found in nearly all industries and  professions.   In our rapidly changing world where digital technology and data science seem to dominate the world of work, it seems  that little that is taught in the liberal arts is relevant to the future. However, this is increasingly being proven wrong, just  by looking at the majors of CEOs of successful multinational corporations today: Stewart Butterfield, Slack, philosophy;  Jack Ma, Alibaba, English; Susan Wojcicki, YouTube, history and literature; Kenneth Chenault, American Express, history; Brian  Chesky, AirBnB, fine arts; Denise Morrison, Campbell Soup, psychology.",
        "The dominance of humanities majors in C-suite  professionals in big tech proves that what matters nowadays is not so much the technical skills learned in college but how one  thinks. Asking the right questions to identify gaps, problems, and solutions to address real human needs is key to securing  one’s future in a volatile, uncertain, complex, and ambiguous (VUCA) world. Even in STEM industries, liberal arts graduates  can find niches in areas such as marketing, sales, strategy, communications, or customer-driven work such as customer  relation or account management.",
        "In fact, this is one reason why local universities are also designing multi and  interdisciplinary course offerings, to help graduates keep relevant to the needs of the job market. The interdisciplinary  approach in a liberal arts education equips graduates with the ability to look at problems from multiple angles, giving  them an advantage in problem solving, especially if the problems faced are never of the same nature.                 Adapted from:  •  Harvard Business Review.",
        "Liberal Arts in the Data Age   https://hbr.org/2017/07/liberal-arts-in-the-data-age?utm_campaign=hbr&utm_source=twitter&utm_medium=social  •  Association of American College and Universities. Advocacy for Liberal Education   https://www.aacu.org/advocacy-liberal-education-0  •  Huffington Post. Don’t Overlook Liberal Arts Schools: Small Class Size and Access to Faculty.",
        " https://www.huffpost.com/entry/dont-overlook-liberal-art_b_10574942   •  Strada Education Network. When the Robots Come for our Jobs, Will they Spare the Liberal Arts Grads?  https://www.forbes.com/sites/stradaeducationnetwork/2019/05/09/when-the-robots-come/?sh=aebf784ac7f7  •  Pete Davies.",
        "What is a Liberal Arts Degree and What Can You Do With It?.   https://www.snhu.edu/about-us/newsroom/2018/09/what-is-a-liberal-arts-degree   "
    ],
    "Guide to Arts Majors 2022 page 11": [
        "  Copyright: Higher Education Office, Raffles Institution, 2022    11    GEOGRAPHY  Geography involves the study of the physical and human  environments. This discipline explores the features of the physical  environment that we live in, the interaction between human  behaviour and the environment, as well as the ways that societal  changes have affected physical spaces.     WHO WOULD ENJOY GEOGRAPHY?",
        " Do you wonder why temperatures during winter are warmer? Why are natural disasters happening around the world  more frequently? Are you interested in learning more about environment-related policies that affect topics such as  climate change?",
        "Do you enjoy watching documentaries or reality TV shows such as Food Inc, Life Below Zero, Blackfish,  during your free time? How can our physical spaces accommodate societal changes, such as population size or a shift  towards an aging population? How does migration and globalisation affect the places we live in?",
        "If you get excited about  these questions and are interested in learning more, pursuing a degree in Geography may be an option for you.    WHAT DOES STUDYING GEOGRAPHY LOOK LIKE?  Geography is a diverse field of study.",
        "Students who pursue a degree in Geography  can study topics related to physical spaces, such as land degradation, natural  resource management and environmental cycles, and natural disasters. They may  also explore human geography, where studies can be on policies related to  climate change, agricultural developments and food scarcity, for instance.  Students also have the opportunity to explore topics related to the social  environment such as inequality, social justice and diversity in space.",
        "Upon  graduation, students may choose to find jobs in areas pertaining to policy  planning, education, economic development, industrial or urban design and  planning.     WHERE CAN I STUDY GEOGRAPHY?  NUS CHS is the only local institution that offers Geography as a major.",
        "However, students who are pursuing a separate  degree in the School of Social Sciences at NTU (e.g., Economics, Sociology) can pursue an interdisciplinary minor in  Geography and Urban Planning. This minor allows student to understand theories and concepts on physical spaces while  also learning how to changes urban spaces such that they are more effective.   Students also have the option of studying Geography at several overseas universities.",
        "For example, at the University of  Nottingham (UK), students pursuing a Bachelor of Science in Geography can enrol in courses that examine different  landscapes, cultures, and environment globally and the interaction between these areas. Field trips are also included in  the curriculum to provide students with the opportunity to gain first-hand experience of how the concepts and theories  learned are applied. Universities in the US, such as Penn State, may offer the option of both a Bachelor of Arts and  Bachelor of Science degree.",
        "Programmes may also include opportunities for students to achieve certificates in Geography  on a specific topic. At Penn State, options include a diverse range from Geospatial Big Data Analysis, to Justice, Ethics,  Diversity in Space, and Landscape Ecology.    "
    ],
    "Guide to Arts Majors 2022 page 12": [
        "  Copyright: Higher Education Office, Raffles Institution, 2022    12    WHAT POSSIBLE PATHWAYS CAN A DEGREE IN THIS MAJOR LEAD TO?  Geographers are well placed to tackle some of the most pressing issues of our day, including climate change, natural  disasters and reconstruction, urban development, overpopulation, gentrification, displacement, and so on. Their training  in social survey, data analysis and interpretive methods, skills in preparing maps and diagrams, and the ability to use  specialist equipment in fieldwork make them sought after in careers where social research skills are key, such as in  geographical information systems, environmental conservation, environmental management, meteorology, remote  sensing, and resource management.",
        "Urban/rural planning, landscape architecture, surveying, and cartography are also  popular career options for geographers.   Given our increasing reliance on technology and the dominance of big tech firms today, geographers can find themselves  designing and working with not just physical maps, but digital ones. Firms such as Huawei, Microsoft and DuPont have  job openings for map coordinator, area solution architect, water research engineer, respectively, which specify  knowledge of geography as a key requisite.",
        "The ability to deal with locale-specific or domain-specific information,  problems and solutions is key to building and deploying solutions across industries and issues, something a Geographer  is well trained to do.   Graduates who prefer Human Geography to Physical Geography can consider work that involves understanding and  building culture, market intelligence, corporate fieldwork, or anything relating to humans and their relationship with  communities, cultures, economies, and the environment. Apart from private companies, many government organisations  and statutory boards whose work involves the development of the country’s infrastructure and liveability, also hire  Geography graduates with a passion in developing our city-state, and/or in promoting Singapore’s interests overseas by  working with specific brands and cultures to promote Singapore to foreign investors.",
        "For example, Geography graduates  could be well suited to roles within the Urban Redevelopment Authority, by engaging in strategic planning efforts for the  city-state to achieve long-term objectives, taking into account the evolving challenges related to the environment.                Adapted from:  •  ThoughtCo. Geography Degree.   https://www.thoughtco.com/geography-degree-overview-1435597  •  American Association of Geographers.",
        "Want a Thriving Department? Focus on Undergraduate Success.  http://news.aag.org/2021/02/focus-on-undergraduate-success/  •  Prospects UK.",
        "Geography.   https://www.prospects.ac.uk/careers-advice/what-can-i-do-with-my-degree/geography   •  Sabrina Collier. What can you do with a Geography degree?",
        "  https://www.topuniversities.com/student-info/careers-advice/what-can-you-do-geography-degree   "
    ],
    "Guide to Arts Majors 2022 page 13": [
        "  Copyright: Higher Education Office, Raffles Institution, 2022    13    ECONOMICS  Economics is the study of how decisions are made with  limited resources available in order to satisfy the individual’s  wants. Topics in economics include jobs and unemployment,  inequality, economic growth, resource allocation, budget,  taxes, and public investment. For students interested in the  Business side of things, please refer to the Business-related  Majors guide, where you can find more information on  business  courses,  including  the  related  course  of  Econometrics, which is often studied together with  Economics, as well as Statistics.",
        "    WHO WOULD ENJOY ECONOMICS?  Does using analytical techniques to examine consumer behavioural patterns, social trends, and policy issues excite you?  Are you curious about the reasoning behind the way certain resources are allocated in society?",
        "Have you wondered how  market forces operate? What factors may lead to a recession? Do these movies fascinate you – A Beautiful Mind, Too Big  to Fail, Moneyball, and The Big Short?",
        "If you find yourself researching on the last economic trends and news during your  free time and are intrigued by the different economic-related policies and theories, then Economics may be the major  for you.  WHAT DOES STUDYING ECONOMICS LOOK LIKE?  There are two main areas of study within Economics:  Microeconomics and Macroeconomics.",
        "Microeconomics explores  the ways that individual consumers and firms make decisions. Topics  include supply and demand, allocation of labour, cost of production  of goods and services. Macroeconomics, on the other hand, studies  the economy as a whole, on both the national and global level.",
        " Topics include foreign trade, unemployment levels, government  fiscal and monetary policies, and Gross Domestic Product.     WHERE CAN I STUDY ECONOMICS?  Economics is offered at the three main local universities, NUS, NTU, SMU.",
        "Students enrolled in both NUS and NTU will  earn a Bachelor of Social Science degree in Economics while a Bachelor of Science degree is earned at SMU. Students may  also choose to pursue the Bachelor of Social Sciences (Honours in Actuarial Science and Economics) at NUS where  students will take courses from the Economics Honours and actuarial studies curricula. At SMU, students have the option  of specialising in the Quantitative Economic Track or in the Real Estate Track beyond the general curriculum.",
        "The  Quantitative Economic Track may be of interest to students who are interested in learning more about and applying  different quantitative methodology in economic analyses. Additional courses in this track include international  macroeconomics, econometrics, and international trade. Students in the Real Estate Track will take additional courses  such as real estate economics and real estate investments and finance.",
        " An undergraduate degree in Economics can also be pursued overseas. Most universities offer students the option of  pursuing a Bachelor of Arts (B.A.) or a Bachelor of Science (B.Sc.) degree in Economics. Generally, the main difference  between a B.A. and B.Sc. degree in Economics is the quantitative emphasis, with the latter having a greater emphasis  "
    ],
    "Guide to Arts Majors 2022 page 14": [
        "  Copyright: Higher Education Office, Raffles Institution, 2022    14    compared to the former. For example, at the University of Washington-Seattle, students pursuing a B.A. and B.Sc. will  take common courses such as introduction or microeconomics and introduction to macroeconomics. However, those  pursuing a B.Sc. will take more advanced mathematics courses such as Calculus with Analytic Geometry II and III.",
        "Students  whose goal is to pursue a Ph.D. in economics are encouraged to complete the requirements of the B.Sc.  WHAT POSSIBLE PATHWAYS CAN A DEGREE IN THIS MAJOR LEAD TO?  Economics has been long viewed as the (social) science to study, because it promises plenty of opportunities and stability  in any kind of economy. The degree provides the framework for understanding economic indicators, business cycles, and  fiscal policies, which is crucial for interpreting the impact of world events and policy decisions in governments, on the  economy, financial markets, and related areas.",
        "As such, economists can be found in both public and private sectors.   Economists with a B.Sc., a strong mathematical background and an interest in financial markets can consider jobs in  trading, stockbroking, finance and accounting. Those who have particular interests in statistics and data analysis can  consider actuary or financial risk analysis, where statistical formulae are used to assess risk.",
        "For example, an actuarial  analyst in an insurance firm will need to determine the policy premiums to be charged for different demographics  according to their average life expectancy. Similarly, a financial risk analyst in a bank will typically need to analyse the risk  to the company of its customers defaulting on loans or of the risk of external factors that may affect the bank’s share  price or market position. Such analysts are in demand across the financial services industry, including general finance,  insurance, investment, fund management, stockbroking, etc.",
        "  Economists with a B.A. who prefer to deal with macro issues and/or products and sales can consider jobs in business  strategy, market research, sales, compliance, regulatory affairs, and even trade surveillance. Transferable skills learned  as an Economics major, such as numeracy, research, critical thinking, and communication, are relevant in any firm that  has a product or brand to sell and that requires someone to figure out the driving forces shaping society, the economy,  and consumer behaviour. For example, a product specialist in an advertising firm looking to launch a new product will  need to understand its target audience, current economic trends, and social perception concerning other similar products  in order to pitch it at a level that will be well received by its target audience.",
        "  Notable individuals who majored in Economics include former UN Secretary General Kofi Annan, former American  President George H W Bush, business magnate Warren Buffett, co-founder of the Bill and Melinda Gates Foundation  Melinda Gates, former CEO of eBay Meg Whitman, former Microsoft CEO Steve Ballmer, Habitat for Humanity founder  Millard Fuller, football manager Arsene Wenger, and even actor Arnold Schwarzenegger. A number of Singapore’s  political leaders, such as Senior Minister and Coordinating Minister for Social Policies Tharman Shanmugaratnam, Deputy  Prime Minister Heng Swee Keat, Minister for Trade and Industry Chan Chun Sing, Minister for Education Lawrence Wong,  and Minister of State for Education and Manpower Gan Siow Huang also hold Bachelor’s degrees in Economics.      Adapted from:  •  American Economic Association.",
        "What is Economics? Understanding the Degree  https://www.aeaweb.org/resources/students/what-is-economics  •  Investopedia. Guide to Economics.",
        "  https://www.investopedia.com/terms/e/economics.asp  •  Department of Economics, University of Washington. Choosing your Economics Degree.  https://econ.washington.edu/choosing-your-economics-degree  •  Singapore Management University.",
        "10 Unexpected Jobs for an Economics Major.   https://admissions.smu.edu.sg/our-community/graduate-stories/10-unexpected-jobs-economics-major  "
    ],
    "Guide to Arts Majors 2022 page 15": [
        "  Copyright: Higher Education Office, Raffles Institution, 2022    15    LAW  Law is the study of rules implemented by the country to regulate  behaviour, ensure order, and uphold justice within society.  Topics within Law include Corporate Law, Family Law, Criminal  Law, Immigration Law, and Real Estate Law. Jurisprudence  meanwhile, involves the philosophy of Law, where students may  study concepts of morality and explore the essential question of  the natural state of Man: is he a moral being?",
        "    WHO WOULD ENJOY LAW?  Are you an avid reader (this means hundreds of pages each week)? Do you find debates (both as a member of the  audience and as a participant) enjoyable?",
        " Have you found television series such as Suits, Law and Order, When They See  Us fascinating and enjoy the scenes where lawyers are battling it out in the courtroom (even though some parts of the  show may be dramatised)? Are you drawn to grey areas, and love puzzling your way out of dilemmas? If so, then pursuing  a Law degree may be right path for you.",
        "    WHAT DOES STUDYING LAW LOOK LIKE?  Law is a flexible degree that encompasses a wide range of disciplines.  Regardless of the university, students will be required to take several,  compulsory courses at the start of their programme (i.e., typically the first 2  years) from a range of areas.",
        "This includes Corporate Law, Law of Contract,  Criminal Law, Contract Law, Constitutional and Administrative Law, etc. After  that, students can choose to take elective courses from a diverse range of  topics (e.g., Asian Legal Studies, Intellectual Property and Technology Law, etc.),  as specialisation then occurs according to interest. Through the programme,  students not only gain a deeper understanding of Law-related theories and  policies, but also develop skills relevant for their career (e.g., presentation skills,  critical thinking, teamwork), as there is a lot of reading, writing, and presentations involved.",
        "Students who excel in Law  love reading, are precise in analysis and enjoy seeing issues from multiple perspectives.    WHERE CAN I STUDY LAW?  Undergraduate degrees in Law are offered in Singapore, the UK, and Australia.",
        "The Bachelor of Laws (LLB) undergraduate  degree is a 4-year programme in Singapore while the standard LLB programme is 3 years in the UK (e.g., Queen Mary  University of London, University of Bristol). Even if you decide not to pursue Law as an undergraduate, you have the  opportunity to do so at the graduate level at either NUS or SMU. Both universities offer the Juris Doctor (J.D.) and Master  of Laws programmes.",
        "  In the USA, Law is typically offered as a graduate degree. Students who choose to pursue law will first complete an  undergraduate degree in a related field (e.g., Sociology, Psychology, Political Science). Students interested in attending  Law school in the US would have to take the Law School Admission Test (LSAT).",
        "However, studying law in the US in order  to practise it in Singapore is a highly uncommon path among students, given the availability of approved, global  undergraduate law degrees, and that very few US universities’ J.D qualifications are recognised in Singapore. Ultimately,  "
    ],
    "Guide to Arts Majors 2022 page 16": [
        "  Copyright: Higher Education Office, Raffles Institution, 2022    16    regardless of the programme that you choose and the country that you decide to pursue your degree in, it is important  to know which countries (or states, if in the US) your degree is recognised in and the next steps involved to be called to  the Bar. For example, if your goal were to practice law in Singapore, you would have to complete Part A of the Singapore  Bar Examinations if you had graduated from an overseas university. It is also important to note that overseas law  programmes can only be pursued as a single degree or major for anyone who wishes to practise law in Singapore.",
        "It is  good to check the Ministry of Law’s website on the list of recognised legal degrees, if your aim is to practice in Singapore  eventually. For boys with NS: do so in your year of application, as there may be updates to this list.    WHAT POSSIBLE PATHWAYS CAN A DEGREE IN THIS MAJOR LEAD TO?",
        " In the legal industry, law graduates who are interested in pursuing a career in law may consider becoming a corporate  lawyer, State Counsel, Deputy Public Prosecutor (DPP), disputes lawyer, or in-house counsel, after passing the Bar.   State Counsels primarily seek to protect the interests of the public and the nation through legislative drafting, judicial  work, and/or constitutional and administrative law concerning civil society and international affairs. For example, State  Counsels in the Civil Division can deal with issues ranging from government procurement, public finance, land acquisitions,  and all types of regulatory matters.",
        "State Counsels in the International Affairs Division can deal with International Trade  and Investment Law, Air and Oceans Law, and International Criminal and Human Rights Law and Privileges and Immunities.  On the other hand, DPPs in the Attorney-General’s Chambers (AGC) primarily focus on upholding criminal justice in the  country, whether in advising the Corrupt Practices Investigation Bureau (CPIB) or other law enforcement agencies on  charges to be brought against suspected criminals. The pre-requisites for State Counsel and DPP in Singapore are a law  degree from NUS, SMU, SUSS, or an approved university in England, Australia, New Zealand, or the USA, and two years  of post-qualification experience.",
        "  In contrast to constitutional and administrative law, corporate law entails understanding the regulatory framework under  which all companies must operate, such as corporate tax returns, Goods and Services Tax regulation, labour laws,  personal data protection compliance, contract laws, and anti-competitive activities. Depending on the law firm, corporate  lawyers can deal with a wide range of business-related issues, such as mergers and acquisitions, real estate transactions,  security law, franchise law, entity law, and so on. Whichever the choice of specialty or field of work, legal work involves  a lot of writing and reviewing of legal documents, interpreting laws, and gathering evidence for a case, research public  and legal records, and advising clients.",
        "  It is not necessarily true that a Law graduate must go on to join the legal profession; one can also consider career  opportunities in other industries, such as in consulting, academia, business or politics & diplomacy. The skills honed in  law school, such as critical thinking, negotiation, problem solving, and conflict resolution, can give one an advantage in  jobs that prioritize such skills, such as in mediation, consulting, or even charity work.         Adapted from:  •  British Council.",
        "Study Law in the UK. https://study-uk.britishcouncil.org/study-law-uk  •  Law School Admission Council. Discover Law.",
        "https://www.lsac.org/discover-law  •  The Guardian. Five Reasons to Love Studying Law.   https://www.theguardian.com/law/2014/mar/06/five-reasons-love-studying-law  •  Attorney-General’s Chambers.",
        "Job Opportunities. https://www.agc.gov.sg/careers/job-opportunities   "
    ],
    "Guide to Arts Majors 2022 page 17": [
        "  Copyright: Higher Education Office, Raffles Institution, 2022    17    HISTORY  History is the study of the past. Through History, we are able to gain  greater insight on present and future events. History also enables us to  understand the behaviours of the people around us, the society that we  live in, and allows us to create our unique identity.",
        "     WHO WOULD ENJOY HISTORY?  Is the History Channel one of your favourite channels? Do you find yourself including trips to museums when you travel  overseas?",
        "If you do, do you also notice that (i) you can spend almost the entire day at the museum and/or (ii) reading  through most, if not every, work on display as you make your way through the museum? When reading the descriptions  of the artefact, do you find yourself feeling curious and wanting to know more about the source? If given a choice, would  you rather spend your free time watching the latest season of a popular television drama or a documentary like the Age  of Samurai: Battle for Japan on Netflix?",
        "If your choice is the latter, history might be the major for you.     WHAT DOES STUDYING HISTORY LOOK LIKE?    History is a diverse area of study.",
        "Students who pursue a degree in  History can learn about the history of different countries within Asia  (e.g., Southeast Asia, China, Japan, etc.), Europe, and America. In  addition to understanding more about the historical backgrounds  of these countries, the interdisciplinary nature of History enables  students to learn about the evolution of other areas such as culture,  food resources, information technology, and medicine.   Since History can be both a reading and writing intensive course,  students who enjoy reading and writing may have fun in this course.",
        " By practicing evaluating sources of information throughout the course of their programme, students will learn critical  thinking and analytical skills, which will be useful for their future career.     WHERE CAN I STUDY HISTORY?  Students can pursue a Bachelor of Arts degree in History at NUS and NTU.",
        "At NUS, students enrol in a variety of courses,  delving into regional and country-focused topics such as Korea in the Twentieth Century, or Singapore’s Military History.  Broader topics such as Law, Crime, and Punishment in History, and Empires, Colonies and Imperialism are also studied,  giving a holistic view of how the past influenced societies and cultures. In addition to pursuing a History major, students  also have the option of declaring a minor in Art History where they will not only gain a deeper knowledge of the different  art types (e.g., sculpture, architecture, painting, etc.), but also have the opportunity to apply the information within  related disciplines (e.g., cultural studies and political science).",
        "Partnerships between NUS and the National Gallery  Singapore allow students the opportunity to attend classes at the museums, and to work as an intern.   At NTU, students will take five core classes in History that focus on History within Asia-Pacific and Singapore. Aside from  these, students can choose from courses on Applied History (e.g., Film: A Global History), Global Asia (e.g., China in  Revolution and Reform), Interdisciplinary History (e.g., Feasting and Fasting, Health and Illness), and World History (e.g.,  "
    ],
    "Guide to Arts Majors 2022 page 18": [
        "  Copyright: Higher Education Office, Raffles Institution, 2022    18    Race, Gender, Class and Colonial Power). Students who qualify to complete a final year project will be required to do so  at the end of the 4-year programme.    A Bachelor of Arts (B.A.) degree in History can also be pursued overseas.",
        "Different universities have different course  requirements and structure, so it is a good idea to look carefully at the modules in the History curriculum offered by a  school before choosing it. Some schools may have a predominantly regional focus, while others may focus on a certain  specialisation, such as on a period of time (for instance, Ancient History) or subject. For example, students who intend to  major in History at Northwestern University can have either a geographic concentration or a global history concentration.",
        "    WHAT POSSIBLE PATHWAYS CAN A DEGREE IN THIS MAJOR LEAD TO?   Over the course of attaining their B.A. in History, graduates would have read and debated a wide variety of topics, been  exposed to as well as processed and analysed vast amounts of information to engage in historiographical debate. The  critical, analytical, and verbal and written communication skills required to excel in History put graduates at an advantage  in jobs that require those same skills.",
        "  The most typical career options for History graduates are found in the heritage and education sectors. Graduates who  have excellent knowledge of particular cultures or societies, recognise the importance of history, and have a desire to  preserve it for the benefit of mankind can consider careers in archiving and heritage, such as museum curator, archivist  or heritage manager. For example, they can focus on the upkeep and organisation of historical artefacts, from taxidermy  animals to famous paintings, or work with archaeologists to preserve historical sites and increase public awareness on  them.",
        "Those who are more research inclined can consider academia, where constant learning and transfer of knowledge  to the next generation can fuel their desire to preserve knowledge for future generations.   However, not all History graduates necessarily need to work as professional Historians or in heritage. Those who prefer  to deal with current affairs or politics can consider careers in broadcasting and journalism, politics, business, or finance,  just to name a few.",
        "Their analytical minds and in-depth knowledge of languages, cultures or regions can give them an  advantage in jobs that focus on current societies and future developments, particularly in business and politics. For  example, those who have knowledge of how business and capitalism developed over the decades, or how social and  cultural factors affect economic development, would be valued in the business world, especially in multinational  corporations (MNCs) with global offices and clientele. Similarly, historians who specialise in analysing political events of  the past and the historical developments of political systems are well placed to become political advisors or politicians.",
        " Opportunities in the legal industry – whether in practising law or in administration – are also available for those with a  B.A. in History keen to pursue post-graduate studies in law, since a keen analytical mind and strong critical reasoning  skills are similarly required.         Adapted from:  •  American Historical Association. Why Study History.",
        "https://www.historians.org/about-aha-and-membership/aha-history- and-archives/historical-archives/why-study-history-(1998)  •  Laura Tucker. What Can You Do With a History Degree?   https://www.topuniversities.com/student-info/careers-advice/what-can-you-do-history-degree       "
    ],
    "Guide to Arts Majors 2022 page 19": [
        "  Copyright: Higher Education Office, Raffles Institution, 2022    19    POLITICAL SCIENCE   Political Science examines the theory and methodology of  politics and the government within three perspectives: local,  international, and comparative. In addition to understanding  the policies and political ideologies of institutions, topics  pertaining to diplomacy, classes, war and strategy are also  explored.      WHO WOULD ENJOY POLITICAL SCIENCE?",
        " Are you interested in finding out why different countries have different  political systems, and what their impact on politics and society is? Do you find  yourself wondering how the media affects politics? Do you wonder if  presidential or parliamentary systems are more efficient in policy-making, and  why?",
        "During Elections season, do you find yourself watching political debates  whether in Singapore or overseas? Do you spend your free time reading up on  how political factors explain the variations in the levels of economic  development in the world? If your response is a ‘yes’ to any of the above  questions, a major in Political Science may be suitable for you.",
        "   WHAT DOES STUDYING POLITICAL SCIENCE LOOK LIKE?   There are four main subfields within Political Science: Country-specific Politics (for instance, American Politics),  Comparative Politics, Political Theory, and International Relations. Notable sub-disciplines include political philosophy,  political economy, political methodology, domestic politics and government, and political anthropology.",
        "  Political Science can also be pursued at the graduate level; a Master’s in Public Administration or Public Policy are  considered professional degrees just like the Juris Doctor for lawyers and the Masters in Business Administration for  business executives.    WHERE CAN I STUDY POLITICAL SCIENCE?  In the USA, Political Science is offered as a single major at several large-scale universities, such as the University of  Michigan, or in the smaller liberal arts colleges, such as Swarthmore College.",
        "While most universities in the US require  students to take at least one course in the four major subfields of Political Science (i.e., American Politics, Comparative  Politics, Political Theory, and International Relations), differences may arise. It should also be noted that universities may  have different names for these subfields. For example, International Relations is known as World Politics at the University  of Michigan (U of M).",
        "At the U of Michigan, students have the option of taking classes from an additional subfield, known  as Methodology courses which are designed to inculcate in students the analytical tools to carry out political science  research. Thus, it is good practice to look into the actual modules offered in Political Science by a school, before  choosing the school or major, and ask, does it cover your areas of interest?  In the UK, one popular choice is the interdisciplinary degree of Political Science as part of the Philosophy, Politics, and  Economics programme offered at several universities (e.g., York University, King’s College London, University College of  London).",
        "This is a 3-year programme where students will take courses in Philosophy, Policy, and Economics, and learn  about the interdisciplinary nature of the three subjects.   "
    ],
    "Guide to Arts Majors 2022 page 20": [
        "  Copyright: Higher Education Office, Raffles Institution, 2022    20    A degree in Political Science can also be pursued at one of the three local universities. The Bachelor of Social Sciences  degree in Public Policy and Global Affairs is a 4-year programme offered by the School of Social Sciences at NTU. The  interdisciplinary nature of this programme allows students to attain a holistic perspective on policy analysis, and non- profit management.",
        "This also equips students with the relevant skills and knowledge for a career in the public or private  sector locally as well as in regional or global organisations. At SMU, students who pursue a Bachelor of Social Science  degree can choose to major in either Psychology, Political Science or Sociology (PPS) or Politics, Law, and Economics (PLE).  As part of the PPS interdisciplinary major, students can choose to focus on one of the three majors (i.e., Psychology,  Political Science, and Sociology).",
        "Students who are interested in topics related to global politics, economic development,  and legal frameworks should consider pursuing the PLE major.   Students can also choose to pursue a Bachelor of Arts or Bachelor of Social Sciences (Honours) in Political Science at the  Faculty of Arts and Social Sciences at NUS CHS. Students can also choose to pursue Political Science as a second major or  minor.",
        "A wide range of courses pertaining to Singapore politics, international relations, and political theory are some  options that students can choose from.     WHAT POSSIBLE PATHWAYS CAN A DEGREE IN THIS MAJOR LEAD TO?  Political Science majors seek to understand the exercise of power from domestic, international, and comparative  perspectives, and in so doing hone their analytical thinking, research, writing and presentation skills.",
        "This makes them  prepared for careers in a variety of settings, whether in the public or private sector. A typical offshoot of political science  is the field of public administration, in which public policy is put into practice. Political science majors typically feel at  home here, as their training in analysing ideas, policies, processes and behaviour can help them determine the pragmatic  approach to take in policy implementation.",
        "The specific area of work will depend on the person’s interest; for example,  a graduate who is passionate about equity, social justice, and about examining socio-economic classes can consider jobs  in the Ministry of Home Affairs or Social and Family Development, analysing and drafting policy papers to recommend  changes to existing social structures or systems to benefit the average citizen. Other ministries are also possible, given  the applicability of the degree to the work of policy makers.   Graduates who are keen to pursue these ideas, ideologies, or groups at a deeper level have the option of enrolling in a  graduate degree programme to become a political scientist, and can consider academia, where rigorous academic debate  is prioritised over pragmatic concerns.",
        "  Graduates who prefer not to work for the state but still want to put political science theories into practice can consider  careers in the corporate or non-profit sectors, such as advocacy, corporate consulting, communications, human resources,  public relations, and intelligence. An intelligence advisor at a corporate firm with a political science background, for  example, can draw on his knowledge of political systems to analyse the political and economic factors that pose direct  and indirect risks to the firm’s business.     Adapted from:  •  Northwestern University.",
        "What is Political Science? https://polisci.northwestern.edu/undergraduate/index.html  •  Department of Political Science, University College of London. Philosophy, Politics, and Economics BSc.  https://www.ucl.ac.uk/political-science/study/undergraduate/philosophy-politics-and-economics-bsc  •  Anne Dennon.",
        "What Can You Do With a Political Science Degree? https://www.bestcolleges.com/blog/what-to-do-with-a- political-science-degree/   "
    ],
    "Guide to Arts Majors 2022 page 21": [
        "  Copyright: Higher Education Office, Raffles Institution, 2022    21    SOCIAL WORK  Social work is a practice-based profession that strives to facilitate the well-being of the  individual, family, and community. In addition to the promotion of growth, the  interdisciplinary nature of social work involves the interaction between different social,  economic and cultural institutions. It should be noted that a pursuing a career in social  work is different from pursuing volunteerism, as professional social workers require an  approved degree, given the specialisation necessary in this field.",
        "   WHO WOULD ENJOY SOCIAL WORK?  Are you intrinsically motivated to help the less fortunate? Do you spend your free time mentoring youth from  disadvantaged family backgrounds or who may have experienced trauma or abuse?",
        "Are you complimented for your  proficient interpersonal skills, effective communication, patience, and professionalism? In group or dyadic settings, do  you notice yourself taking on the role of the listener? Do you enjoy a good challenge and seek out solutions for the issue,  with both empathy and pragmatism?",
        "Do you wish to help others, not just from the heart but also the head? If these  questions resonate with you, then a career in Social Work may be a good fit for you.     WHAT DOES STUDYING SOCIAL WORK LOOK LIKE?",
        "   Studying Social Work involves a mix of classroom teaching, interpersonal skills  training and supervised field practice. Students will learn social science theories  (including psychology), research methods, social work practices, organisational  planning, and human resource management, and have the opportunity to apply  what they have learned during a field placement under the supervision of a social  work practitioner. Depending on the university, students can also choose to study  specific people groups in more details, for example, the elderly, or choose from a  variety of electives such as psychiatric rehabilitation.",
        " Students also have the option of pursuing a graduate degree programme in social work, specialising in a specific social  issue, such as domestic violence, disease management, or public housing, or in a specific demographic group, such as  community offenders or children with special needs.    WHERE CAN I STUDY SOCIAL WORK?  Students can pursue an undergraduate degree in Social Work at NUS and SUSS.",
        "A Bachelor of Social Science (Honours)  degree in Social Work is a 4-year programme offered by the Faculty of Arts and Social Sciences at NUS. Students can  declare Social Work as a single major, second major, or attain a minor in Human Services. In addition to completing the  required coursework, students will need to participate in two field placements during the May-July vacation at the end  of the first and second years.",
        "Pre-requisite modules will need to be completed and passed before enrolling in the field  placements.  A Bachelor of Social Science degree in Social Work is a 4-year direct Honours programme offered by the School of Human  Development and Social Services at SUSS. Students will complete several core courses on Social Work, Human  Development, Social Issues, etc.",
        "and can also select electives (e.g., Social Advocacy, Introduction to Psychiatric  "
    ],
    "Guide to Arts Majors 2022 page 22": [
        "  Copyright: Higher Education Office, Raffles Institution, 2022    22    Rehabilitation etc.) they may be interested in based on a wide range of options. In addition to their course work, students  are also required to complete 1,000 hours of supervised social work field education (work attachment), an overseas  experience, and community engagement. Students who decide to pursue a different undergraduate degree can choose  to pursue a Graduate Diploma or Master’s degree in social work either at NUS or SUSS.",
        " In order to attain professional recognition by the Singapore Association of Social Workers, graduates need to meet the  requirement, including practicum requirements, specified by the association. Upon graduation, students have the option  of choosing to specialize in an area within the field (e.g., Children, Youth, and family, Disability, Elderly, Social  Policy/Administration, and Medical, Psychiatric and Mental Health etc.).    WHAT POSSIBLE PATHWAYS CAN A DEGREE IN THIS MAJOR LEAD TO?",
        " Social workers can practice in a variety of settings, such as government ministries, family service centres, community  development centres, prisons, rehabilitation agencies, hospitals, hospices and other healthcare agencies. As practitioners,  social workers can choose to work with a specific group of people, such as older persons or children, or work on specific  issues, such as mental health, domestic violence or abuse. The specific path taken will depend on the social worker’s  interest and passion.",
        "  Social Work graduates who are more research-inclined can consider being involved in administrative or policy work, for  example, as a social work researcher, family life educator, interpersonal communication and social skills trainer. Students  who further their studies in Social Work and specialise in particular areas might also have more options available to them,  such as child protection services officer, medical social work officer, counsellor, family therapist, or social services  manager. The confluence of the social worker’s interest, passion, skill set and preference will determine the exact setting  of practice.",
        "For example, a social worker who wants to provide counselling services while working in a clinical or hospital  setting can become a medical social worker who educates or counsels families or individuals assessing the risks of medical  treatments or discussing after-treatment plans. They strive to understand the psychosocial needs of patients and counsel  them accordingly.                  Adapted from:  •  Singapore Association of Social Workers.",
        "Social Work in Singapore.  https://www.sasw.org.sg/index.php?option=com_content&view=article&id=208&Itemid=211  •  Social Work License Map. What is Social Work?",
        "  https://socialworklicensemap.com/become-a-social-worker/what-is-social-work/    "
    ],
    "Guide to Arts Majors 2022 page 23": [
        "  Copyright: Higher Education Office, Raffles Institution, 2022    23     LINGUISTICS  It is often said that the thing that separates humanity from animals – other than cooked  food – is language. Being able to communicate with language is one of the reasons why  humanity has become so powerful.                    - Anon.",
        "   Linguistics is the scientific study of language. It involves analysing its form, structure and  context, the various aspects that make up human language. It also looks at the interplay  between sound and meaning, and how language varies between people and situations.",
        "     WHO WOULD ENJOY LINGUISTICS?  It seems like a no-brainer to say that you should be proficient in a particular language if you want to study Linguistics, but  more than proficiency, a deep motivation to know and understand the inner workings of the language and to appreciate  how context can affect linguistic usage and meaning is even more crucial. Someone who enjoys tracking the dynamic  relationship between language user and context would enjoy Linguistics.",
        "Someone who is interested in how one‘s identity  is reflected in one’s linguistic choices or how one set of utterances could be interpreted differently in various situations  would enjoy Linguistics.      WHAT DOES STUDYING LINGUISTICS LOOK LIKE?   Linguistics degrees cover a multitude of topics relating to the analysis of  language and the way it is structured.",
        "They can also cover the way that  language changes over time, how it varies between different groups of people  and situations and how people learn or acquire language.  The first year of your course typically focuses on an introduction to linguistics,  including grammar, meaning (semantics), syntax (sentence formation),  sounds (phonology) and words (morphology). The course content for the  second and third years of study will vary widely between universities but can cover anything from typology, experimental  phonetics, language acquisition, child bilingualism, modern foreign languages, the study of regional speech, the history  of language and neurolinguistics, sociolinguistics, psycholinguistics, among many others.",
        " Linguistics courses may also incorporate aspects of psychology, sociology, anthropology, communications studies and  science.    WHERE CAN I STUDY LINGUISTICS?  Given its versatility and importance to societies, you can study linguistics in many universities, in almost every region of  the world.",
        "Linguistics can be studied at both undergraduate and post-graduate levels. These degrees can be studied singly  or combined with other related majors. For instance, the combination of Linguistics with Philosophy, or Linguistics with  Psychology, are popular choices—this latter can be studied in a range of universities, from the University of Edinburgh in  the UK, to UCLA in the US.",
        "    Students can note that in multicultural and multi-lingual countries, linguistics may be combined with multilingual studies,  opening the interesting avenue of comparative linguistics, which prepares students for an in-depth understanding of  cultures and languages, and how these shape societies. Locally, for instance, NTU offers the Linguistics and Multilingual  Studies major, while NUS CHS offers a major in English Language and Linguistics. Being at the vantage point between East  and West, our local universities, NUS and NTU, have very well-established and thriving Linguistics departments which are  popular with both local and overseas students, being well placed to promote academic studies of language and  multilingualism in Singapore, one of the best-known examples of a modern, vibrant and successful multilingual society.",
        " "
    ],
    "Guide to Arts Majors 2022 page 24": [
        "  Copyright: Higher Education Office, Raffles Institution, 2022    24    WHAT POSSIBLE PATHWAYS CAN A DEGREE IN THIS MAJOR LEAD TO?    The skills acquired during a linguistics degree can be adapted for most industries.   Professional linguists work in a number of fields and engage in a range of successful and fulfilling careers.",
        "Individuals with  degrees in linguistics tend to specialise in particular areas within the field and build their careers around those areas.   Academic linguists devote themselves to a life of science, and after much training often become university professors,  sharing their love of linguistics with like-minded undergraduate students and conducting research that is essential to the  field, and sharing their results with the scientific community through publications, lectures, and conferences.  Those who specialise in computational approaches to linguistic problems may work in the computer industry on issues  of speech recognition, speech synthesis, artificial intelligence, natural language processing, or computer-mediated  language learning.",
        "These linguists provide vital skills and expertise in the technology sector.  Some linguists use their abilities and training to work in government. Linguists’ analytical skills are in high demand to  conduct research, provide language-related technological services, and contribute important insight on issues of law,  policy, and education.",
        " With their training in the mechanics of languages, linguists have a strong advantage in the field of language education.  Linguists involved in education are not restricted to teaching; they also develop educational materials, train language  teachers, develop standardized testing materials, and find means to assess acquisition and more effectively teach  language.   Linguists also work to document, analyse, and preserve endangered languages by conducting fieldwork and establishing  literacy programs.",
        "This type of work can be highly rewarding for linguists collaborating with language communities around  the world to help revitalize their languages.  With additional training, translation and interpretation are other potential careers for linguists. Linguists are uniquely  prepared for these lines of work, needed in businesses, court rooms, hospitals, schools, and more, given their in-depth  understanding of how languages function.",
        "  Other career paths that are available to one who is trained in linguistics are: lexicographer, speech and language therapist,  languages teacher, copy editor, proofreader or a role in communications. Other career paths may include, but are not  limited to, the civil service, marketing, journalism, law and IT.            Adapted from:    https://www.timeshighereducation.com/student/subjects/what-can-you-do-linguistics-degree    https://www.oxford-royale.com/articles/studying-linguistics/    https://www.usnews.com/education/best-colleges/linguistics-major-overview    https://www.linguisticsociety.org/resource/linguistics-profession    https://fass.nus.edu.sg/ell/    https://www.ntu.edu.sg/soh/about-us/linguistics-and-multilingual-studies      "
    ],
    "LKCMedicine UCAT information and FAQ page 1": [
        "WHEN DO I NEED TO SIT THE UCAT? If you plan to apply to LKCMedicine for entry in  August 2024 then you will need to sit the test  before 28 September 2023. The UCAT Consortium  universities are listed on the back of this leaflet.",
        " You should also check individual university  websites for specific entry requirements of each  course that you are applying to. If you are applying for a place at the Lee  Kong Chian School of Medicine  (LKCMedicine) in Singapore, you will be  required to sit for UCAT as part of the entry  requirements. The UCAT is a computer- based test delivered at test centres  throughout the UK and internationally.",
        "2023 UCAT UNIVERSITY CLINICAL APTITUDE TEST Applying to  Medicine Connect with us for the latest news ucat.ac.uk @ucatofficial @UCATofficial  KEY DATES FOR UCAT 2023 16 May UCAT Account creation opens Access Arrangement  applications open 20 June     Booking opens 10 July Testing begins 19 September  7pm (SGT) Access Arrangements  deadline 21 September   7pm (SGT) Booking deadline 28 September Last testing day Early November Results delivered to  LKCMedicine TEST FEES Tests taken in Singapore \t £115 (~SGD$191) Lee Kong Chian School of Medicine "
    ],
    "LKCMedicine UCAT information and FAQ page 2": [
        "WHAT’S IN THE TEST? The UCAT is a two-hour, multiple choice test.  It consists of five separately timed  subtests which assess a range of mental abilities identified by university medical  and dental schools as important.",
        "  VERBAL REASONING Assesses the ability to critically evaluate  information presented in written form. DECISION MAKING  Assesses the ability to make sound  decisions and judgements using complex  information. QUANTITATIVE REASONING  Assesses the ability to critically evaluate  information presented in numerical form.",
        "ABSTRACT REASONING  Assesses the use of convergent and  divergent thinking to infer relationships  from information. SITUATIONAL JUDGEMENT TEST  Measures the capacity to understand  real world situations and identify critical  factors and appropriate behaviour in  dealing with them. 2023 UCAT UNIVERSITY CLINICAL APTITUDE TEST HOW DO I PREPARE FOR THE UCAT?",
        "Use the Question Tutorials to  guide you through each subtest  and learn strategies on how to  approach and answer questions Visit the UCAT website to  ﬁnd out the key information  you need to know Use the Tour Tutorial to understand the format of the UCAT  and learn  the functions of the  computer-based test Check out advice from high scoring  candidates on our website and on  the Oﬃcial UCAT YouTube channel Take Practice Test A on the UCAT  website. These tests closely mimic the  test experience and questions are of  equivalent standard to the actual test Take the remaining Practice Tests – step up  your practice by sitting the remaining practice  tests under timed conditions to improve your  speed as you get closer to sitting your test Use our FREE question banks  to practise hundreds of  example questions HOW DO I BOOK A TEST? You need to register to take the test via  the UCAT website and can then book a  test at a convenient location and time.",
        " Details of how to register for the test  are on our website under the REGISTER  page. We strongly recommend that you  take the test at your earliest convenience. It’s important to note that you can  only sit the test once in each  admissions cycle.",
        "ACCESS ARRANGEMENTS If you have any special educational needs  and require additional time or rest breaks  in exams, extended tests are available.  Information regarding how to apply to  sit these, and other accommodations  available can be found on our website  under ACCESS ARRANGEMENTS. "
    ],
    "LKCMedicine UCAT information and FAQ page 3": [
        "All details are correct at the time of going to print in April 2023.  Please check our website for up to date information.. WHEN DO I GET MY RESULTS?",
        "You will receive a copy of your UCAT score report  before you leave the test centre. Your score report will  also be accessible online through your UCAT account  within 24 hours of taking the test. You can then use  your UCAT score to make an informed decision about  which universities to apply to.",
        "WHAT ELSE DO I NEED TO KNOW? The UCAT is unlike most exams you may be used to,  so it’s useful to understand what to expect on the day  of the test. You should ensure you are familiar with the  test centre environment before the day by reading the  TEST DAY section of our website.",
        "It is essential that you take the correct, signed,  photographic identification to the test centre,  otherwise you will not be permitted to test. Please  ensure you’ve read the ID POLICY page of our website  ahead of time to avoid any issues. Scan here for the: UCAT 2023 OFFICIAL GUIDE The list opposite is subject to change, so please check the UCAT website for  an up to date list of universities and courses before you book your test.",
        "WHICH UNIVERSITIES  REQUIRE THE UCAT? UK Universities University of Aberdeen Anglia Ruskin University Aston University University of Birmingham University of Bristol Brunel University London Cardiff University University of Central Lancashire University of Chester University of Dundee University of East Anglia Edge Hill University University of Edinburgh University of Exeter University of Glasgow Hull York Medical School Keele University Kent and Medway Medical School King’s College London University of Leicester University of Liverpool University of Manchester University of Newcastle University of Nottingham Plymouth University Queen Mary, University of London Queen’s University Belfast University of Sheffield University of Southampton University of St Andrews St George’s, University of London University of Sunderland University of Surrey University of Warwick (graduate entry) University of Worcester  International Universities American University of the Caribbean University of Kurdistan Hewlêr Lee Kong Chian School of Medicine  (LKCMedicine), Nanyang Technological  University, Singapore "
    ],
    "LKCMedicine UCAT information and FAQ page 4": [
        "Applying to study medicine at the Lee Kong Chian  School of Medicine, Nanyang Technological University for admissions in AY2024-25? If so, you will need to take the University Clinical Aptitude Test (UCAT) from 10 July 2023 to 28 September 2023. Key dates for UCAT 2023 UCAT Account creation opens: 16 May 2023 Booking opens: 20 June 2023 Testing begins: 10 July 2023 Access Arrangements deadline: 19 September 2023, 7pm (SGT) Booking deadline: 21 September 2023, 7pm (SGT) Last testing day: 28 September 2023 Results delivered to LKCMedicine: Early November 2023 Find out more about UCAT: https://www.ucat.ac.uk/ *UCAT results are valid for 12 months only "
    ],
    "LKCMedicine UCAT information and FAQ page 5": [
        "FREQUENTLY ASKED QUESTIONS  on the University Clinical Aptitude Test (UCAT) 2023  1. What is the University Clinical Aptitude Test (UCAT)? The University Clinical Aptitude Test (UCAT) is a computer-based admissions test,  used by a consortium of UK Universities and non-UK associate member universities  including Nanyang Technological University, Singapore to help select applicants for  medical and dental degree programmes.",
        "It is a two-hour test consisting of five  separately timed subtests in multiple-choice format. It is an aptitude test focused on  assessing a range of mental abilities and knowledge candidates should already have.  The UCAT is developed and administered by the UCAT Consortium.",
        "Registration for  the UCAT usually takes place between every May and September.   2. Why is UCAT required for admissions to LKCMedicine?",
        "The UCAT, which is currently being used for top-level medical schools in the UK  including King’s College London, Edinburgh and Manchester universities to name a  few, provides information about a student’s aptitude for medicine and has been a good  predictor of a student’s performance in medical school. The use of UCAT for admission  to LKCMedicine will ensure parity of student selection.  3.",
        "Can BMAT results be accepted for AY2024-25 admissions cycle? No. Only UCAT results taken in the twelve-month period prior to application for  admission will be accepted for selection.   4.",
        "How can an applicant prepare for UCAT? UCAT assesses a range of mental abilities identified by medical and dental schools  as important. You are recommended to use the free official materials developed by  the UCAT Consortium.",
        "The resources have been developed using feedback from  previous high-scoring candidates to support your test preparation.   To find out more, please visit: https://www.ucat.ac.uk/prepare/preparation-resources/  "
    ],
    "LKCMedicine UCAT information and FAQ page 6": [
        "2  Updated as at 18 June 2023  5. Are there UCAT preparatory courses recommended by LKCMedicine? LKCMedicine does not endorse any preparatory course for the UCAT.",
        "You can access  free official preparation materials from UCAT’s website.   6. When and where should an applicant take the UCAT?",
        "If you are applying to the AY2024-25 admissions, you should take the UCAT between  July and September 2023, prior to applying to LKCMedicine. Only results of the UCAT  taken in the twelve-month period prior to application to LKCMedicine will be  considered in the selection process.   This year’s UCAT will commence from 10 July and end on 28 September 2023.",
        "You  will receive a copy of your UCAT score report before leaving the test centre.  LKCMedicine will receive your UCAT results in early November 2023.   The UCAT can be taken in Singapore and overseas.",
        "Applicants can use the test centre  locator function on the UCAT website to find the nearest Pearson VUE test centre.  There are currently two test centres in Singapore:   • Pearson Professional Centers-Singapore, 51 Cuppage Road, #05-02/03/04, Singapore 229469 • NTUC LearningHub Pte Ltd, NTUC Trade Union House, 73 Bras Basah Road, Singapore 189556 7. Which test should applicants take, UCAT or UCAT ANZ?",
        "The majority of applicants to LKCMedicine will sit the UCAT.  You will only need to sit the UCAT ANZ if you are applying to LKCMedicine and a  relevant course at one of the UCAT ANZ Consortium member universities in Australia  or New Zealand. The Information about UCAT ANZ can be found here  https://www.ucat.edu.au/.",
        " 8. Can an applicant sit for both the UCAT and UCAT ANZ tests? Applicants may only take the test once in any test window.",
        "You are therefore not  permitted to sit both the UCAT and the UCAT ANZ in the same year. In this event only  the test result obtained at the first sitting is valid.   "
    ],
    "LKCMedicine UCAT information and FAQ page 7": [
        "3  Updated as at 18 June 2023  9.  What if you have taken the UCAT ANZ test? You will be required to indicate your UCAT ANZ candidate ID (e.g., in the sample  format: ANZ12345678) in your application to LKCMedicine for admission.",
        " LKCMedicine will obtain your UCAT ANZ results directly from the UCAT office.   10.  When and how can I register for the UCAT?",
        "Registration for the UCAT is a two-step process of creating an account and booking a  test, using the Pearson VUE registration system.   During registration for the UCAT, you will be able to indicate that you are applying to  LKCMedicine for admission to the MBBS programme.  Students are advised to obtain registration details from the UCAT website  https://www.ucat.ac.uk/.",
        " 11.  What is the fee for UCAT? You will be prompted to make fee payment during the booking of your test date.",
        "The  fee is payable by major debit/credit card via your UCAT Account:   Tests taken in the UK: £70 (approximately S$115)  Tests taken outside the UK:  £115 (approximately S$190)  To find out more, please visit https://www.ucat.ac.uk/register/booking-your-test/  12.  Is financial aid available for eligible students? Financial assistance is available to students in need who wish to sit for the  UCAT.",
        "Students may approach their schools to obtain financial assistance.      Please email Ms. Joyce Tan at joyce.tan@ri.edu.sg to request for a fee subsidy. 13.",
        "What is the application process for students requesting financial assistance? Schools will advise students who are eligible for financial assistance.  If you are currently on financial assistance, email Ms Joyce Tan at  joyce.tan@ri.edu.sg.",
        " "
    ],
    "LKCMedicine UCAT information and FAQ page 8": [
        "4  Updated as at 18 June 2023  14. What is the UCAT cut-off score for admissions to LKCMedicine? The cut-off scores for UCAT differ yearly as they will depend on the strength of the  application cohort.",
        "AY2024-25 is the first year LKCMedicine will accept UCAT results  for admission selection. The 10th and 90th percentile UCAT scores of students admitted  in AY2024-25 will be published in due course.  15.",
        "Should I submit my UCAT results for application to LKCMedicine? This is not necessary if you had indicated that you are applying to LKCMedicine during  registration for the UCAT. LKCMedicine will receive your results from UCAT directly in  early November 2023.",
        "We will also encourage you to remember your UCAT candidate  number as this would have to be provided when you subsequently apply to  LKCMedicine for admission.   "
    ],
    "US Application Writing Talk 2023 page 1": [
        "Writing the US  application Ms Edlyn Ang Higher Education Office,  2023 "
    ],
    "US Application Writing Talk 2023 page 2": [
        "UK and US Statement Talks No. Date and time Type of statement Venue 1 12 Jul (Wed) 1030 – 1130 (concurrent sessions) Writing for the UK: Humanities majors LT5 2 Writing for the UK: Science majors LT3 3 12 Jul (Wed) 1200 – 1300 Writing the US application LT3 4 19 Jul (Wed) 1030 – 1130 Writing for the UK: Humanities majors (repeat) LT3 5 19 Jul (Wed) 1200 – 1300 (concurrent sessions) Writing for the UK: Science majors (repeat) LT5 6 Writing the US application (repeat) LT3 "
    ],
    "US Application Writing Talk 2023 page 3": [
        "What we will be covering today • Applying to US unis: key deadlines and resources  • Focal points of the US application • Writing your 5 Hons, 10 Activities and essays • Final notes All examples used in this guide are fictitious.  "
    ],
    "US Application Writing Talk 2023 page 4": [
        "Key CIALFO deadlines to adhere to What CIALFO Deadline Remarks • US Early Applications  (all Early Programmes) 20 Oct 2023, 1700h Students confirm university choices in  CIALFO. This deadline is non-negotiable.  Common App is submitted later, by the  deadline of the respective school.",
        "• US Regular  Applications 18 Dec 2023, 1700h Students confirm university choices in  CIALFO. This deadline is non-negotiable.  Common App is submitted later, by the  deadline of the respective school.",
        "Notes: 1. You may begin to create your CIALFO account from mid-Aug, after HEO publishes the CIALFO guide. Refer  to Timelines 2023/2024 (see next slide).",
        "2. The UCs are on their own portal. Application period is 1 Oct to 30 Nov.",
        "See:  https://admission.universityofcalifornia.edu/how-to-apply/applying-as-a-freshman/ "
    ],
    "US Application Writing Talk 2023 page 5": [
        "https://ivy.ri.edu.sg/courses/4090 Bookmark this and turn on IVY notifications!  "
    ],
    "US Application Writing Talk 2023 page 6": [
        "The companion US application writing guide can be found in  Module 402 in IVY HEO. Read it for more details. "
    ],
    "US Application Writing Talk 2023 page 7": [
        "Resources: Finding the right  school for you • All US universities are on a liberal arts curriculum.  • Research not just on brand name, but on practical  factors that matter to your sense of wellbeing:  safety, urbanity, the cultural environment, etc.  • Explore further by looking into each school’s  courses.",
        " • Given the high cost of a US education (SGD$400k  ++), and the effort & time needed for writing for  each school, consider well if this is an undertaking  you want to pursue. It should not come at the  expense of your wellbeing or your A levels.  "
    ],
    "US Application Writing Talk 2023 page 8": [
        "Some useful resources to begin • https://www.timeshighereducation.com/world-university-rankings/2023/world- ranking • https://www.topuniversities.com/university-rankings/world-university-rankings/2024 • https://www.usnews.com/best-colleges/rankings/national-universities How to utilize such lists: a) Focus first on what your criteria are –e.g., size of the university & location? Any  particular state/city? Safety?",
        "What education do you expect, versus what is  practically available in SG? b) When filtering, avoid going for confirmation bias. Look in particular at names that  you are less familiar with.",
        "Research and consider if you would be a good fit. Keep in  mind: It is not just about entry, it’s about graduating well. c) HEO’s recommendation is 5 to 8 schools for US applications.",
        "Beyond this, quality  often suffers. Avoid spamming or FOMO.  "
    ],
    "US Application Writing Talk 2023 page 9": [
        "Focal points of the US application 1. The 5 Academic Honours 2. The 10 Activities 3.",
        "The Essays –CA essay & supplementals for every school  you apply to Referred to by HEO  as the 5+10 or 10+5  "
    ],
    "US Application Writing Talk 2023 page 10": [
        "1. The 5 Academic Honours  • Academic Honours refer to prizes & accolades won in a specific academic discipline, or for all-rounded excellence in academia. • In the Common App, you can list 5 Honours.",
        "This is under the Education  section.  • For each Honour: you have up to 100 characters to describe the Honour won, state the year(s) you were awarded, as well as the level of  recognition. • Honours are from Sec 3 to Year 6 (this is the SG equivalent of Grades 9 to  12 in the American high school system).",
        " "
    ],
    "US Application Writing Talk 2023 page 11": [
        ""
    ],
    "US Application Writing Talk 2023 page 12": [
        "You have 100 characters for  this. #HEOprotip: Useful to  contextualise the degree of  excellence where necessary.  I.e., where possible, give some  rank or percentile, so that you  qualify exceptionalism.",
        ""
    ],
    "US Application Writing Talk 2023 page 13": [
        "Is mine an academic honour? • Subject Prize –E.g., Top in subject—and Academic Excellence awards • FIRE awards • Essay Writing competitions (e.g., MAS, John Locke)  • Cyber/AI/Computing-related competitions & research projects • Sports, Colours Awards • Character & leadership awards • Business-related competitions (e.g., by local universities) • SSEF/Science presentations & publications • Diploma/Licentiate in Music (e.g., Piano) • MOE JC A*STAR, MOE Humanities Scholarship, related JC-level scholarship  For specific awards (leaving aside all-round excellence awards), the acid test: Is this an academic major  commonly available in university?  "
    ],
    "US Application Writing Talk 2023 page 14": [
        "2. The 10 Activities  • In Common App, for each Activity, you will:  • specify the activity type  • be given 50 characters for position/leadership  description,  • 100 characters for the organization name,  • and 150 characters to describe what you did.  • In checkboxes and short fields, you indicate  when you took part, specify the no: of hours/week,  and no: of weeks/year.",
        " • You are also asked if you intend to participate in  a similar activity in college. "
    ],
    "US Application Writing Talk 2023 page 15": [
        "Understand that  Activities illuminate the  person you are. Focus  on the who and why,  not the what. Activities  are not the same as  achievements and  awards.",
        ""
    ],
    "US Application Writing Talk 2023 page 16": [
        "These are  important in giving  your readers a  sense of the  person you are. "
    ],
    "US Application Writing Talk 2023 page 17": [
        "2. What giving a sense of the person looks like Regular style of writing, focused on  achievement/listing/doing • Activity 1 Position/Org: Member, Raffles Music Band Description: Participated in Founder’s Day  ceremony & played at 2 charity concerts.  Organised concert schedule for the band.",
        "• Activity 2 Position/Org: Captain, Quidditch Team Description: Captained the team in the  National Schools Games, winning 2  consecutive Golds.  • Activity 3 Position/Org: Volunteer, Flag Day Description: Raised funds for the Red Cross,  collected $1,000 in a single day.  Personalised style of writing, focusing on  illuminating the who, whys & learnings • Activity 1 Position/Org: Blues & Rock Drummer, Raffles Music Band Description: Played in 3 concerts; largest audience of 1,200 was...",
        "My all-time favourite song is … because… • Activity 2 Position/Org: Captain, Quidditch Team Description: Captained the team that won 2 National  Schools Games Golds. To lead is to… • Activity 3 Position/Org: Volunteer in 3 charities, for underprivileged  children Description: Mentored two Grade 6 students; raised funds,  created 3 awareness campaigns. What hit me most was… "
    ],
    "US Application Writing Talk 2023 page 18": [
        "Writing the 10 Activities: • Sense-making is more important than the doing. The person is the focus. • Useful to refer to your RDB as a starting point in curating your list of  activities.",
        "This keeps you grounded and authentic.  • When elaborating on the ‘doing’, some degree of specificity in what you did  helps in preventing anonymity. Be succinct; avoid unnecessary detail.",
        "• More importantly: Use space wisely to shed light into your motivations and  learnings from the experience.  • A properly written 10 Activities should be so unique, only you could have  written it.  "
    ],
    "US Application Writing Talk 2023 page 19": [
        "Writing the essays: How to know what  questions to choose & what to write about • Your essays focus on the match between you and the school.  • To do this well, know yourself first. Highlight your strengths, based  realistically on what you have done in the past 4 years.",
        " • Know the values/principles/mission of the school. Curation is to focus  on what resonates between you and the school. • Each prompt should ideally demonstrate a different facet of yourself,  that matches with the school.",
        "  "
    ],
    "US Application Writing Talk 2023 page 20": [
        "The essays: Using the UCs as an example (8C4) 1. Describe an example of your leadership experience in which you have positively  influenced others, helped resolve disputes or contributed to group efforts over time.  2.",
        "Every person has a creative side, and it can be expressed in many ways: problem  solving, original and innovative thinking, and artistically, to name a few. Describe how you  express your creative side. 3.",
        "What would you say is your greatest talent or skill? How have you developed and  demonstrated that talent over time?  4.",
        "Describe how you have taken advantage of a significant educational opportunity or  worked to overcome an educational barrier you have faced. 5. Describe the most significant challenge you have faced and the steps you have taken to  overcome this challenge.",
        "How has this challenge affected your academic achievement? 6. Think about an academic subject that inspires you.",
        "Describe how you have furthered  this interest inside and/or outside of the classroom. 7. What have you done to make your school or your community a better place?",
        " 8. Beyond what has already been shared in your application, what do you believe makes  you a strong candidate for admissions to the University of California? "
    ],
    "US Application Writing Talk 2023 page 21": [
        "The essays –tips & guiding questions Tips • Best to write essays after you have written your  5+10!  • The insight you give in the 5+10 may be picked  up and elaborated about in further detail in your  essays, making for consistency in the whole. It  also sustains the reader’s interest in getting to  know you.",
        " • Know your purpose for each prompt: what,  exactly, do you want to demonstrate about  yourself in the response?  • Avoid overstuffing or repetition. Likewise avoid  apologising for perceived weaknesses.",
        ""
    ],
    "US Application Writing Talk 2023 page 22": [
        "The essays –tips & guiding questions Useful clarifying questions to ask yourself  (whatever the prompts may be): • What are values that are important to you?  • Why did you pursue the things you pursued? • What did you learn from your pursuits?",
        "• Any experience which taught you to see things in  a new or different light? Reflect on growth.  • What of you aligns with the school?",
        " • What kind of person are you in the community,  and will be in future? Why should they welcome  you?  "
    ],
    "US Application Writing Talk 2023 page 23": [
        "In summary The overall is  what matters.  Consistency between what  you have done  & what you say. What you are  really  demonstrating,  is the match between you  and the school.",
        " Choose  questions wisely. Do not clutter  with unnecessary  detail. Know the  point of your  story.",
        "Your application  illuminates the  person, not the  ‘doing’. Whys  and who you  are is  important. Avoid copying- and-pasting  essays between  schools.",
        ""
    ],
    "US Application Writing Talk 2023 page 24": [
        "WHAT NOW? DEADLINES GET STARTED Keep an eye on deadlines and to-dos. Be  timely.",
        "Create your CIALFO & CA accounts in Aug  once we release the guide.  Do not wait until the last minute to book a  counselling appointment, if you feel you  need guidance. (No need to FOMO too, if  you don’t need an appointment!) It makes sense to work on the 5+10 first, in  these next one-to-two months.",
        " This will put you in a good stead for working on  essays in T4 and in the Dec hols. It’s also a good idea to approach your desired  tutors personally first. You can do this from  early Aug onwards.",
        "#HEOprotip: Don’t wait to  the last minute for this! Note: HEO will be offering written feedback  guidance from Aug-Sep. Watch out for IVY  instructions on how you can submit your work  to us, should you wish for feedback.",
        "This will  only be once, for one school of choice, so as to keep your personal voice. "
    ],
    "US Application Writing Talk 2023 page 25": [
        "REMINDERS & FAQs Early vs Regular Timely submission Students should apply Early only if: a) It’s the one school you definitely want  to attend, b) You are coping well with A-level prep  at that point in time, and are ready to  submit your app by late Oct. Early does not equate ‘better’. CIALFO deadlines are non-negotiable.",
        "HEO  guarantees timely submission of your material  when you meet this. You can submit your  Common App by the deadline of the  respective university. On approaching your tutors This means in person and on CIALFO.",
        "They  cannot write for you in the system if you do  not create your account. Do NOT wait until  the Dec holidays to start accounts thus. The  earlier the better.",
        "Give your teachers time to  do the necessary for you.  "
    ],
    "US Application Writing Talk 2023 page 26": [
        "Important reminder for those serving NS • As you still have time over the next 2 years, you should only be  applying for schools that, if offered, you would definitely  accept.  • This is as accepting a US offer invariably includes the  commitment that you will not apply to any other university, in  any part of the world, while your place is being held for you. • While in general, most universities will hold a 2 year deferral, UC  Berkeley does not.",
        "Check university websites for most updated  info. • There is no rush! Apply in the next cycle if you want to focus on  your ‘A’ Levels.",
        "We will still help alumni after graduation. "
    ],
    "US Application Writing Talk 2023 page 27": [
        "Note on integrity • In line with the American universities, it is expected that all work submitted are  authentic and originally written by the student. You will sign off on each  declaration for this.  Columbia University Sample "
    ],
    "US Application Writing Talk 2023 page 28": [
        "HAPPY WRITING! Support each other  on this journey.  RI Higher Education Office "
    ],
    "US Checklist 2023 page 1": [
        "5 Honours 10 Activities CA Essay Supplemental essays for all the colleges you're applying to:  System Checklist Writing Checklist Send in your applications before the deadline Use CommonApp to submit your applications before each university's deadline. It is your responsibility to ensure your applications are submitted on time.  CIALFO will be locked from 21 Oct - 3 Nov to process Early apps.",
        "You'll be able to add/change your RD schools from 4 Nov - 18 Dec.  Note: the UCs are on their own portal. App period is 1 Oct - 30 Nov.",
        "Request activation of CIALFO account US Application Guides on Ivy Refer to the details in our Timelines Guide and CA/CIALFO guides on Ivy EARLY ACTION / DECISION DEADLINE  1 NOV 2023* (* some schools may be earlier) COMMONAPP CIALFO US APPS CHECKLIST Set up CommonApp (CA) account Set up CIALFO account, linked it with CA and waived FERPA Requested recommendation letters (LORs) from your CT and two subject tutors in person and on CIALFO HAVE YOU ? Waive FERPA on CA. Link CA account to CIALFO.",
        "Ensure school list in CA is synced with CIALFO. Request LORs from CT and two Y56 subject tutors by 6 Oct (EA/ED) or 17 Nov (RD). Confirm Early App (EA/ED) choices: 20 Oct 5pm.",
        "Confirm Regular (all) choices: 18 Dec 5pm. Check requirements for schools not on CA. © 2023 Higher Education Office, Raffles Institution System Checklist "
    ]
}